<?php
/**
 *  PHP命名规则
 *      1、类命名：
 *          使用大写字母作为词的分隔，其他的字母均使用小写。
 *          名字的首字母使用大写。
 *          不要使用下划线（_）。
 *      2、类属性命名：
 *          属性命名应该以字符"m"为前缀
 *          前缀"m"后采用与类名一致的规则。
 *          "m"总是在名字的开头起修饰作用，就像以"r"开头的名字表示引用变量一样。
 *      3、方法命名：
 *          方法的名称是应该能说明这个方法是做什么的，要见名知意。
 *          方法的命名规范和类命名是一致的。
 *      4、方法中的参数命名
 *          第一个字符使用小写字母
 *          在首字符后的所有字符都按照类命名规则首字符大写
 *      5、变量命名
 *          所有字母都使用小写
 *          使用"_"作为每个词的分界
 *      6、引用变量/函数命名
 *          引用变量/函数命名要带有"r"前缀。
 *      7、全局变量
 *          全局变量应该带前缀"g"
 *      8、常量/全局变量
 *          常量/全局变量，应该全部使用大写字母，单词之间用“_”来分隔。
 *      9、静态常量
 *          静态变量应该带前缀"s"。
 *      10、函数命名：
 *          函数名中所有的字母都使用小写字母，多个单词使用"_"来分割。
 *
 */


