<?php
/**
 *  数组：
 *          数组就是一组数据的组合，把一系列数据组织起来，形成一个可以操作的整体。
 *          其中每个变量被称为一个元素，每个元素由一个特殊的标识符来区分，这个标识符称为键（也成为下标）。
 *          数组中每个元素都包含两项，键和值。
 *      声明数组：
 *          1、array array([mixed ...])
 *          2、直接为数组元素赋值的方式声明数组。
 *
 *      数组的类型：
 *          1、数字索引数组
 *              数字索引一般表示数组元素在数组中的位置，它由数字组成，下标从0开始。
 *          2、关联数组
 *              关联数组的键名可以是数字和字符串混合的形式，在一个数组中，只要键名中有一个不是数字，那么这个数组就是关联数组。
 *      输出数组：
 *          使用print_r()函数可以将数组结构进行输出。
 *
 *      一维数组：
 *           当一个数组的元素是变量时，这个数组就是一维数组。
 *           一维数组是最普通的数组，它只保存一列内容。
 *      二维数组：
 *           一个数组的元素的如果是一维数组，那么这个数组就是二维数组。
 *
 *      遍历数组：
 *           1、用foreach结构遍历数组
 *           2、使用list()函数遍历数组
 *
 *
 */

